import React from 'react';
import { azkarSections } from './Data';

const Azkar = ({ activeAzkarContent, handleAzkarClick, handleBackToAzkar }) => {
    return (
        <div>
            {activeAzkarContent === null && (
                <div className="mt-4 p-4 bg-white bg-opacity-10 shadow-md">
                    <h2 className="text-2xl mb-4 text-white text-center">الأذكار</h2>
                    <div className="grid grid-cols-2 gap-4">
                        {azkarSections.map(section => (
                            <div
                                key={section.id}
                                className="azkar-section p-4 bg-green-500 text-white text-center cursor-pointer transition-transform duration-300"
                                onClick={() => handleAzkarClick(section.id)}
                            >
                                <div className="text-4xl">{section.icon}</div>
                                <div className="mt-2 text-xl">{section.name}</div>
                            </div>
                        ))}
                    </div>
                </div>
            )}
            {activeAzkarContent && (
                <div id="so" className="relative mt-4 p-4 bg-white bg-opacity-70 shadow-md">
                    <button className="absolute top-2 right-2 text-red-500 text-2xl" onClick={handleBackToAzkar}>×</button>
                    {/* Display the content of the selected azkar section */}
                    {activeAzkarContent === 'morning' && (
                        <>
                         <div className= "  text-center">
                            <h2 className="text-2xl mb-4 text-center text-yellow-800 ">أذكار الصباح</h2>
                            <div className="text-red-500 text-xl mt-4">
                                بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                            </div>
                            <div className="text-black text-xl">
                                الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-red-500 text-xl mt-4">
                                بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                            </div>
                            <div className="text-black text-xl">
                                قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)
                            </div>
                            <div className="text-red-500 text-xl mt-4">
                                بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                            </div>
                            <div className="text-black text-xl">
                                قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.
                            </div>
                            <div className="text-red-500 text-xl mt-4">
                                بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                            </div>
                            <div className="text-black text-xl">
                                قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                أصـبحنا وأصـبح المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذا اليوم وخـير ما بعـده ، وأعـوذ بك من شـر ما في هـذا اليوم وشر ما بعـده، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها أعتقه الله من النار
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.

                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها حين يصبح أدى شكر يومه
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم

                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم
                            </div>
                            <div className="text-gray-500 text-xl mt-4">
                                من قالها لم يضره من الله شيء
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم.
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                أعـوذ بكلمـات الله التـامـات من شـر ما خلـق
                            </div>
                            <br></br>
                            <hr></hr>
                            <div className="text-black text-xl">
                                اللهم صل وسلم وبارك على نبينا محمد
                            </div>
                            <br></br>
                            <hr></hr>

                            <div className="text-black text-xl">
                                اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.
                                <br></br>
                                <hr></hr>

                                اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال.

                                <br></br>
                                <br></br>
                                <hr></hr>
                                أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه.
                                <br></br>
                                <br></br>
                                <hr></hr>
                                يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك.
                                <br></br>
                                <br></br>
                                <hr></hr>
                                اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا.
                                <br></br>
                                <br></br>
                                <hr></hr>
                                اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم.

                                <br></br>
                                <br></br>
                                <hr></hr>
                                لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.

                                <br></br>
                                <br></br>
                                <hr></hr>
                                سبحـان الله وبحمـده.
                                <br></br>
                                <br></br>
                                <hr></hr>
                                أستغفر الله وأتوب إليه


                            </div>
                            <br></br>
                            <hr></hr>
                            </div>
                        </>
                    )}
                    {activeAzkarContent === 'evening' && (
                        <>
                        <div className="  text-center">
                        <h2 className="text-2xl mb-4 text-center text-yellow-800 ">أذكار المساء</h2>
                        <div className="text-red-500 text-xl mt-4">
                          بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                        </div>
                        <div className="text-black text-center  text-xl">
                          الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.
                        </div>
                        <div className="text-gray-500 text-xl mt-4">
                          من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح
                        </div>
                        <br></br>
                        <hr></hr>
                        <div className="text-red-500  text-center text-xl mt-4">
                          بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                        </div>
                        <div className="text-black text-center  text-xl">
                          آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
                        </div>
                        <div className="text-gray-500 text-xl mt-4">
                          من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.
                        </div>
                        <br></br>
                        <hr></hr>
                        <div className="text-red-500 text-xl mt-4">
                          بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                        </div>
                        <div className="text-black text-xl">
                          قل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ
                        </div>
                        <div className="text-gray-500 text-xl mt-4">
                          من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)
                        </div>
                        <div className="text-red-500 text-xl mt-4">
                          بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                        </div>
                        <div className="text-black text-xl">
                          قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.
                        </div>
                        <div className="text-red-500 text-xl mt-4">
                          بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                        </div>
                        <div className="text-black text-xl">
                          قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.
                        </div>
                        <br></br>
                        <hr></hr>
                        <div className="text-black text-xl">
                          أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .
                          من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.
                          من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.
                          من قالها أعتقه الله من النار.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.
                          من قالها حين يمسى أدى شكر يومه.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.
                          من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.
                          لم يضره من الله شيء.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.
                          من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.
                          كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.
                          <br></br>
                          <br></br>
                          <hr></hr>
                          <br></br>
        
                          سُبْحـانَ اللهِ وَبِحَمْـدِهِ.
                        </div>
                        </div>
                      </>
                    )}
                    {activeAzkarContent === 'prayer' && (
                         <>
                        <div className="  text-center">
                         <h2 className="text-2xl mb-4 text-center text-yellow-800" >أذكار بعد الصلاة</h2>
         
                         <div className="text-red-500 text-xl mb-4">أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.</div>
                         <div className="text-black text-xl mt-4">
                           اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl mt-4">
                           لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl mt-4">
                           لا إلهَ إلاّ اللّـه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl mt-4">
                           سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           ثلاثا وثلاثين مره
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl mt-4">
                           لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-red-500 text-xl mt-4">
                           بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                         </div>
                         <div className="text-black text-xl">
                           قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.
                         </div>
                         <div className="text-red-500 text-xl mt-4">
                           بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                         </div>
                         <div className="text-black text-xl">
                           قل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.
         
                         </div>
                         <div className="text-red-500 text-xl mt-4">
                           بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                         </div>
                         <div className="text-black text-xl">
                           قل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.
         
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-red-500 text-xl mt-4">
                           بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                         </div>
                         <div className="text-black text-xl">
                           الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl">
                           لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           عشر مرات بعد المغرب والصـبح
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl">
                           اللهـم إنـي أسألـك علمـا نافعـا ورزقـا طيـبا ، وعمـلا متقـبلا.
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           بعد السلام من صلاة الفجر
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl">
                           اللهم أجرني من النار
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           بعد صلاة الصبح والمغرب
         
                         </div>
                         <br></br>
                         <hr></hr>
                         <div className="text-black text-xl">
                           اللهم أعني على ذكرك وشكرك وحسن عبادتك
                         </div>
                         <div className="text-gray-500 text-xl mt-4">
                           مره واحده فقط
                         </div>
                         <br></br>
                         <hr></hr>
                         </div>
                       </>
                     )}
         
                     {activeAzkarContent === 'sleep' && (
                       <>
                        <div className="  text-center">
                         <h2 className="text-2xl mb-4 text-center text-yellow-800 ">أذكار النوم</h2>
                         <div className="text-black text-xl">
         
                           باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           اللهـم قنـي عذابـك يـوم تبـعث عبـادك.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
         
                           باسـمك اللهـم أمـوت وأحـيا.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
         
         
                           سبحان الله.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           الحمد لله.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           الله أكبر.
                           <br></br>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           <div className="text-red-500 text-xl mt-4">
                             بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                           </div>
                           <div className="text-black text-xl">
                             آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
                           </div>
                           <div className="text-gray-500 text-xl mt-4">
                             من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.
                           </div>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           <div className="text-red-500 text-xl mt-4">
                             بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
                           </div>
                           <div className="text-black text-xl">
                             الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.
                           </div>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           <div className="text-red-500 text-xl mt-4">
                             أذكار من قلق في فراشه ولم ينم
                           </div>
                           <div className="text-black text-xl">
                             عن بريدة رضي الله عنه، قال‏:‏ شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال‏:‏ يا رسول الله‏!‏ ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم‏:‏ ‏"‏إذا أويت إلى فراشك فقل‏:‏ اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت‏"
         
                             عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات‏:‏ ‏"‏أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون‏"
                           </div>
                           <br></br>
                           <hr></hr>
                           <br></br>
                           <div className="text-red-500 text-xl mt-4">
                             أذكار الأحلام
                           </div>
                           <div className="text-black text-xl">
                             عن أبي قتادة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏"‏الرؤيا الصالحة‏"‏ وفي رواية ‏"‏الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره‏"
                           </div>
                         </div>
                         </div>
                       </>
                    )}
                   
                   {activeAzkarContent === 'wake' && (
              <>
               <div className="  text-center">
                <h2 className="text-2xl mb-4 text-yellow-800 text-center ">أذكار الاستيقاظ</h2>

                <div className="text-black text-xl text-center  ">
                  الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره.
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  لا إله إلا الله وحـده لا شـريك له، له الملـك وله الحمـد، وهو على كل شيء قدير، سـبحان الله، والحمـد لله ، ولا إله إلا الله والله أكبر، ولا حول ولا قوة إلا بالله العلي العظيم. رب اغفر لي.
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>

                </div>
               </div>
              </>
            )}
            {activeAzkarContent === 'doa' && (
              <>
                <div className="  text-center">
                <h1 className=" text-center text-yellow-800">الْأدْعِيَةُ القرآنية</h1>
                <div className="text-black text-xl">

                  "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار"
                  <br></br>
                  [البقرة - 201].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين"
                  <br></br>
                  [البقرة - 250].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين"
                  <br></br>
                  [البقرة - 286].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>


                  "ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب"
                  <br></br>
                  [آل عمران - 8].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>


                  "ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار"
                  <br></br>
                  [آل عمران - 16].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء"
                  <br></br>
                  [آل عمران - 38].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>

                  "ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين"
                  <br></br>
                  [آل عمران - 53].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين"
                  <br></br>
                  [آل عمران - 147].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار ربنا إنك من تدخل النار فقد أخزيته وما للظالمين من أنصار ربنا إننا سمعنا مناديا ينادي للإيمان أن آمنوا بربكم فآمنا ربنا فاغفر لنا ذنوبنا وكفر عنا سيئاتنا وتوفنا مع الأبرار ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد".
                  <br></br>
                  [آل عمران -  191-194].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين"
                  <br></br>
                  [الأعراف - 23].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا لا تجعلنا مع القوم الظالمين"
                  <br></br>
                  [الأعراف - 47].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا أفرغ علينا صبرا وتوفنا مسلمين"
                  <br></br>
                  [الأعراف - 126].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "حسبي الله لا إلـه إلا هو عليه توكلت وهو رب العرش العظيم"
                  <br></br>
                  [التوبة - 129].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا لا تجعلنا فتنة للقوم الظالمين ونجنا برحمتك من القوم الكافرين"
                  <br></br>
                  [يونس - 85-86].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب إني أعوذ بك أن أسألك ما ليس لي به علم وإلا تغفر لي وترحمني أكن من الخاسرين"
                  <br></br>
                  [هود - 47].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء".
                  <br></br>
                  [إبرهيم - 40].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب"
                  <br></br>
                  [إبرهيم - 41].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا"
                  <br></br>
                  [الإسراء - 80].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا آتنا من لدنك رحمة وهيئ لنا من أمرنا رشدا".
                  <br></br>
                  [الكهف - 10].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب اشرح لي صدري ويسر لي أمري واحلل عقدة من لساني يفقهوا قولي"
                  <br></br>
                  [طه - 25-28].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "وَقُلْ رَبِّ زِدْنِي عِلْمًا"
                  <br></br>
                  [طه - 114].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>

                  "لا إله إلا أنت سبحانك إني كنت من الظالمين"
                  <br></br>
                  [الأنبياء - 87]
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "رب لا تذرني فردا وأنت خير الوارثين".
                  <br></br>
                  [الأنبياء - 89]
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>

                  "رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون"
                  <br></br>
                  [المؤمنون - 97-98].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                  "ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين"
                  <br></br>
                  [المؤمنون - 109]
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>

                  "رب اغفر وارحم وأنت خير الراحمين"
                  <br></br>
                  [المؤمنون - 118].
                  <br></br>
                  <br></br>
                  <hr></hr>
                  <br></br>
                </div>
              </div>
              </>
            )}
                </div>
            )}
        </div>
    );
};

export default Azkar;